system/solid/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


energySource
{
    type            scalarSemiImplicitSource;
    active          true;


    scalarSemiImplicitSourceCoeffs
    {
        selectionMode   all;
        volumeMode      absolute;//specific;//
        injectionRateSuSp
        {
            h           (100 0); //   q in [W]; or in [W/m³] if you use specific mode
        }
    }
}

// ************************************************************************* //
