system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(

    {
        name    air;
        type    cellSet;
        action  new;
        source  labelToCell;
        sourceInfo
        {
          value
          (
          0
          1
          2
          3
          4
          5
          6
          7
          8
          9
          10
          11
          12
          13
          14
          15
          16
          17
          18
          19
          20
          21
          22
          23
          24
          25
          26
          27
          28
          29
          30
          31
          32
          33
          34
          35
          36
          37
          38
          39
          40
          41
          42
          43
          44
          45
          46
          47
          48
          49
          50
          51
          52
          53
          54
          55
          56
          57
          58
          59
          60
          61
          62
          63
          64
          65
          66
          67
          68
          69
          70
          71
          72
          73
          74
          75
          76
          77
          78
          79
          80
          81
          82
          83
          84
          85
          86
          87
          88
          89
          90
          91
          92
          93
          94
          95
          96
          97
          98
...
          )
          ;
        }
    }
    {
        name    air;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set air;
        }
    }

    // bottomAir
    {
        name    solid;
        type    cellSet;
        action  new;
        source  labelToCell;
        sourceInfo
        {
          value
          (
          24405
          24406
          24407
          24408
          24409
          24410
          24411
          24412
          24413
          24414
          24415
          24416
          24417
          24418
          24419
          24420
          24421
          24422
          24423
          24424
          24425
          24426
          24427
          24428
          24429
          24430
          24431
          24432
          24433
          24434
          24435
          24436
          24437
          24438
          24439
          24440
          24441
          24442
          24443
          24444
          24445
          24446
          24447
          24448
          24449
          24450
          24451
          24452
          24453
          24454
          24455
          24456
          24457
          24458
          24459
          24460
          24461
          24462
          24463
          24464
          24465
          24466
          24467
          24468
          24469
          24470
          24471
          24472
          24473
          24474
          24475
          24476
          24477
          24478
          24479
          24480
          24481
          24482
          24483
          24484
          24485
          24486
          24487
          24488
          24489
          24490
          24491
          24492
          24493
          24494
          24495
          24496
          24497
          24498
          24499
          24500
          24501
          24502
          24503
...
          )
          ;
        }
    }
    {
        name    solid;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set solid;
        }
    }

);

// ************************************************************************* //
